SmokyBob/Bluetti_ESP32/Bluetti_ESP32/BWifi.cpp
#include "BluettiConfig.h"
#include "BWifi.h"
#include "BTooth.h"
#include <ESPmDNS.h>
#include "utils.h"
#ifdef ESP32
#include <WiFi.h>
#include <AsyncTCP.h>
#elif defined(ESP8266)
#include <ESP8266WiFi.h>
#include <ESPAsyncTCP.h>
#endif
#include <ESPAsyncWebServer.h>
#include <DNSServer.h>
#include "html.h"
#include <AsyncElegantOTA.h>

AsyncWebServer server(80);
AsyncWebSocket webSocket("/ws");

// Dns infos for captive portal
DNSServer dnsServer;
const byte DNS_PORT = 53;

void resetConfig()
{
  ESPBluettiSettings defaults;
  wifiConfig = defaults;
  saveConfig();
}

bool doCaptivePortal = false;

int _numNetworks = 0;                   // init index for numnetworks wifiscans
unsigned long _lastscan = 0;            // ms for timing wifi scans
unsigned int _scancachetime = 30000;    // ms cache time for preload scans
const boolean _asyncScan = false;       // perform wifi network scan async
unsigned long _startscan = 0;           // ms for timing wifi scans
const boolean _autoforcerescan = false; // automatically force rescan if scan networks is 0, ignoring cache

bool WiFi_scanNetworks(bool force, bool async)
{

  // if 0 networks, rescan @note this was a kludge, now disabling to test real cause ( maybe wifi not init etc)
  // enable only if preload failed?
  if (_numNetworks == 0 && _autoforcerescan)
  {
    Serial.println(F("NO APs found forcing new scan"));
    force = true;
  }

  // if scan is empty or stale (last scantime > _scancachetime), this avoids fast reloading wifi page and constant scan delayed page loads appearing to freeze.
  if (!_lastscan || (_lastscan > 0 && (millis() - _lastscan > _scancachetime)))
  {
    force = true;
  }

  if (force)
  {
    int8_t res;
    _startscan = millis();
    if (async && _asyncScan)
    {
#ifdef ESP8266
#ifndef WM_NOASYNC // no async available < 2.4.0
#ifdef WM_DEBUG_LEVEL
      Serial.println(F("WiFi Scan ASYNC started"));
#endif
      using namespace std::placeholders; // for `_1`
      WiFi.scanNetworksAsync(std::bind(&WiFiManager::WiFi_scanComplete, this, _1));
#else
      Serial.println(F("WiFi Scan SYNC started"));
      res = WiFi.scanNetworks();
#endif
#else
      res = WiFi.scanNetworks(true);
#endif
      return false;
    }
    else
    {
      Serial.println(F("WiFi Scan SYNC started"));
      res = WiFi.scanNetworks();
    }
    if (res == WIFI_SCAN_FAILED)
    {
      Serial.println(F("[ERROR] scan failed"));
    }
    else if (res == WIFI_SCAN_RUNNING)
    {
      Serial.println(F("Wifi Scan running:"));
      while (WiFi.scanComplete() == WIFI_SCAN_RUNNING)
      {
        Serial.println(F("."));
        delay(100);
      }
      _numNetworks = WiFi.scanComplete();
    }
    else if (res >= 0)
      _numNetworks = res;
    _lastscan = millis();

    // Serial.println(F("WiFi Scan completed in " + (String)(_lastscan - _startscan) + " ms"));

    return true;
  }
  else
  {
    // Serial.println(F("Scan is cached " + (String)(millis() - _lastscan) + " ms ago"));
  }
  return false;
}

// based on https://github.com/tzapu/WiFiManager/blob/master/WiFiManager.cpp
String getScanItemOut()
{
  String rows;

  // Scan for wifi networks
  WiFi_scanNetworks(true, false);

  int n = _numNetworks;
  if (n == 0)
  {
    rows += wifiNoNet_html; // No Networks
  }
  else
  {
    // sort networks
    int indices[n];
    for (int i = 0; i < n; i++)
    {
      indices[i] = i;
    }

    // RSSI SORT
    for (int i = 0; i < n; i++)
    {
      for (int j = i + 1; j < n; j++)
      {
        if (WiFi.RSSI(indices[j]) > WiFi.RSSI(indices[i]))
        {
          std::swap(indices[i], indices[j]);
        }
      }
    }

    // remove duplicates ( must be RSSI sorted )
    String cssid;
    for (int i = 0; i < n; i++)
    {
      if (indices[i] == -1)
        continue;
      cssid = WiFi.SSID(indices[i]);
      for (int j = i + 1; j < n; j++)
      {
        if (cssid == WiFi.SSID(indices[j]))
        {
          indices[j] = -1; // set dup aps to index -1
        }
      }
    }

    // Base Row
    const String HTTP_ITEM_STR = wifiRow_html;

    // build networks rows for display
    for (int i = 0; i < n; i++)
    {
      if (indices[i] == -1)
        continue; // skip dups

      uint8_t enc_type = WiFi.encryptionType(indices[i]);

      // if (_minimumQuality == -1 || _minimumQuality < rssiperc) {
      String item = HTTP_ITEM_STR;
      if (WiFi.SSID(indices[i]) == "")
      {
        // Serial.println(WiFi.BSSIDstr(indices[i]));
        continue; // No idea why I am seeing these, lets just skip them for now
      }
      item.replace(F("%CURR_SSID%"), htmlEntities(WiFi.SSID(indices[i]), false)); // ssid no encoding

      rows += item;
    }
  }

  return rows;
}

String processor(const String &var)
{
  String toRet = "";

  if (var == F("TITLE"))
  {
    toRet = DEVICE_NAME;
  }
  else if (var == F("AUTO_REFRESH_B"))
  {
    toRet = toRet + "<b>Page Data autorefreshed every " + String(DEVICE_STATE_UPDATE) + " secs</b></br>";
  }
  else if (var == F("HOST"))
  {
    toRet = WiFi.localIP().toString();
  }
  else if (var == F("SSID"))
  {
    toRet = WiFi.SSID();
  }
  else if (var == F("WiFiRSSI"))
  {
    toRet = WiFi.RSSI();
  }
  else if (var == F("MAC"))
  {
    toRet = WiFi.macAddress();
  }
  else if (var == F("BLUETTI_ID"))
  {
    toRet = wifiConfig.bluetti_device_id;
  }
  else if (var == F("BT_FILE_LOG"))
  {
    if (wifiConfig._useBTFilelog)
    {
      toRet = bt_log_Link_html;
    }
  }
  else if (var == F("DEBUG_INFOS"))
  {
    if (wifiConfig.showDebugInfos)
    {
      toRet = debugInfos_html;
    }
  }

  return toRet;
}

#pragma region Async Ws handlers

void update_root()
{
  String jsonString = "{";

  jsonString += "\"UPTIME\" : \"" + convertMilliSecondsToHHMMSS(millis()) + "\"" + ",";
  jsonString += "\"RUNNING_SINCE\" : \"" + runningSince + "\"" + ",";
  jsonString += "\"UPTIME_D\" : \"" + String(millis() / 3600000 / 24) + "\"" + ",";
  jsonString += "\"B_BT_CONNECTED\" : " + String(isBTconnected()) + "" + ",";
  jsonString += "\"BT_LAST_MEX_TIME\" : \"" + convertMilliSecondsToHHMMSS(getLastBTMessageTime()) + "\"" + ",";
  jsonString += "\"B_AC_OUTPUT_ON\" : " + String((bluetti_state_data[AC_OUTPUT_ON].f_value == "1")) + "" + ",";

