SmokyBob/Bluetti_ESP32/Bluetti_ESP32/BWifi.cpp
  jsonString += "\"FREE_HEAP\" : \"" + String(ESP.getFreeHeap()) + "\"" + ",";
  jsonString += "\"TOTAL_HEAP\" : \"" + String(ESP.getHeapSize()) + "\"" + ",";
  jsonString += "\"PERC_HEAP\" : \"" + String((float(ESP.getFreeHeap()) / float(ESP.getHeapSize())) * 100) + "\"" + ",";

  jsonString += "\"MAX_ALLOC\" : \"" + String(ESP.getMaxAllocHeap()) + "\"" + ",";
  jsonString += "\"MIN_ALLOC\" : \"" + String(ESP.getMinFreeHeap()) + "\"" + ",";

  jsonString += "\"SPIFFS_USED\" : \"" + String(SPIFFS.usedBytes()) + "\"" + ",";
  jsonString += "\"SPIFFS_TOTAL\" : \"" + String(SPIFFS.totalBytes()) + "\"" + ",";
  jsonString += "\"SPIFFS_PERC\" : \"" + String((float(SPIFFS.usedBytes()) / float(SPIFFS.totalBytes())) * 100) + "\"" + ",";

  jsonString += "\"bluetti_state_data\" : {";
  for (int i = 0; i < sizeof(bluetti_state_data) / sizeof(device_field_data_t); i++)
  {
    String tmp = map_field_name(bluetti_state_data[i].f_name);
    tmp.toUpperCase();
    jsonString += "\"" + tmp + "\": " +
                  " \"" + bluetti_state_data[i].f_value + "\",";
  }
  jsonString = jsonString.substring(0, jsonString.length() - 1);
  jsonString += "},";
  String lastWebSocketTime = runningSince;
  struct tm timeinfo;
  if (!getLocalTime(&timeinfo, DEVICE_STATE_UPDATE * 1000))
  {
    Serial.println(F("Failed to obtain time"));
  }
  else
  {
    // Save start time as string in the preferred format
    // Full param list
    // https://cplusplus.com/reference/ctime/strftime/
    char buffer[80];
    strftime(buffer, 80, "%F %T", &timeinfo); // ISO

    lastWebSocketTime = String(buffer);
  }

  jsonString += "\"lastWebSocketTime\" : \"" + lastWebSocketTime + "\"" + "}";
#if DEBUG <= 4
  Serial.println(jsonString); // print the string for debugging.
#endif
  webSocket.textAll(jsonString); // send the JSON object through the websocket
}

void root_HTML(AsyncWebServerRequest *request)
{
#if DEBUG <= 4
  Serial.print(F("handleRoot() running on core "));
  Serial.println(xPortGetCoreID());
#endif

  // logging
  float perc;
  perc = float(ESP.getFreeHeap()) / float(ESP.getHeapSize());
  String toLog = "";
  toLog = toLog + "Free Heap (Bytes): " + ESP.getFreeHeap() + " of " + ESP.getHeapSize() + " (" + perc * 100 + " %)";
  writeLog(toLog);

  toLog = "";
  perc = float(SPIFFS.usedBytes()) / float(SPIFFS.totalBytes());
  toLog = toLog + "SPIFFS Used (Bytes): " + SPIFFS.usedBytes() + " of " + SPIFFS.totalBytes() + " (" + perc * 100 + " %)";
  writeLog(toLog);

  toLog = "";
  toLog = toLog + "Alloc Heap (Bytes): " + ESP.getMaxAllocHeap() + " Min Free Heap (Bytes):" + ESP.getMinFreeHeap();
  writeLog(toLog);

  // Replace tags in the html template before sending it to the client
  request->send_P(200, "text/html; charset=utf-8", index_html, processor);
}

void notFound(AsyncWebServerRequest *request)
{
  bool isPost = true;

  if (request->methodToString() == "GET")
    isPost = false;

  String message = "File Not Found\n\n";
  message += "URI: ";
  message += request->url();
  message += "\nMethod: ";
  message += request->methodToString();
  message += "\nArguments: ";
  message += request->args();
  message += "\n";
  for (uint8_t i = 0; i < request->args(); i++)
  {
    message += " " + request->getParam(i)->name() + ": " + request->getParam(i)->value() + "\n";
  }
  request->send(404, "text/plain", message);
}

void handleBTCommand(String topic, String payloadData)
{
  String topic_path = topic;
  topic_path.toLowerCase(); // in case we recieve DC_OUTPUT_ON instead of the expected dc_output_on

  Serial.print(F("Command arrived: "));
  Serial.print(topic);
  Serial.print(F(" Payload: "));
  String strPayload = payloadData;
  Serial.println(strPayload);

  bt_command_t command;
  command.prefix = 0x01;
  command.field_update_cmd = 0x06;

  for (int i = 0; i < sizeof(bluetti_device_command) / sizeof(device_field_data_t); i++)
  {
    if (topic_path.indexOf(map_field_name(bluetti_device_command[i].f_name)) > -1)
    {
      command.page = bluetti_device_command[i].f_page;
      command.offset = bluetti_device_command[i].f_offset;

      String current_name = map_field_name(bluetti_device_command[i].f_name);
      strPayload = map_command_value(current_name, strPayload);
    }
  }

  command.len = swap_bytes(strPayload.toInt());
  command.check_sum = modbus_crc((uint8_t *)&command, 6);

  sendBTCommand(command);
}

const char *PARAM_TYPE = "type";
const char *PARAM_VAL = "value";

void command_HTML(AsyncWebServerRequest *request)
{

  String topic = "";
  String payload = "";
  bool isPost = true;

  if (request->methodToString() == "GET")
    isPost = false;

  if (request->hasParam(PARAM_TYPE, isPost))
    topic = request->getParam(PARAM_TYPE, isPost)->value();

  if (request->hasParam(PARAM_VAL, isPost))
    payload = request->getParam(PARAM_VAL, isPost)->value();

  if (topic == "" || payload == "")
  {
    request->send(200, "text/plain", "command data invalid: " + String(PARAM_TYPE) + " " + topic + " - " + String(PARAM_VAL) + " " + payload);
  }
  else
  {
    request->send(200, "text/plain", "Hello, POST: " + String(PARAM_TYPE) + " " + topic + " - " + String(PARAM_VAL) + " " + payload);

    handleBTCommand(topic, payload);
  }
}

bool b_paramsSaved = false;
bool b_resetRequired = false;

String processor_config(const String &var)
{
  String toRet = "";

  if (var == F("TITLE"))
  {
    toRet = DEVICE_NAME;
  }
  else if (var == F("PARAM_SAVED"))
  {
    if (!b_paramsSaved)
    {
      toRet = F("display:none");
    }
  }
  else if (var == F("RESTART_REQUIRED"))
  {
    if (!b_resetRequired)
    {
      toRet = F("display:none");
    }
  }
  else if (var == F("BLUETTI_DEVICE_ID"))
  {
    toRet = wifiConfig.bluetti_device_id;
  }
  else if (var == F("WIFI_SCAN"))
  {
    toRet = getScanItemOut();
  }
  else if (var == F("B_APMODE"))
  {
    toRet = (wifiConfig.APMode) ? "checked" : "";
  }
  else if (var == F("SSID"))
  {
    toRet = wifiConfig.ssid;
  }
  else if (var == F("PASSWORD"))
  {
    toRet = wifiConfig.password;
  }
#ifdef IFTTT
  else if (var == F("B_USE_IFTT"))
  {
    toRet = (wifiConfig.useIFTT) ? "checked" : "";
  }
  else if (var == F("IFTT_KEY"))
  {
    toRet = wifiConfig.IFTT_Key;
  }
  else if (var == F("IFTT_EVENT_LOW"))
  {
    toRet = wifiConfig.IFTT_Event_low;
  }
  else if (var == F("IFTT_LOW_BL"))
  {
    toRet = wifiConfig.IFTT_low_bl;
  }
  else if (var == F("IFTT_EVENT_HIGH"))
  {
    toRet = wifiConfig.IFTT_Event_high;
  }
  else if (var == F("IFTT_HIGH_BL"))
  {
    toRet = wifiConfig.IFTT_high_bl;
  }
#endif
  else if (var == F("B_SHOW_DEBUG_INFOS"))
  {
    toRet = (wifiConfig.showDebugInfos) ? "checked" : "";
  }
  else if (var == F("B_USE_DBG_FILE_LOG"))
  {
    toRet = (wifiConfig.useDbgFilelog) ? "checked" : "";
  }
  else if (var == F("BTLOGTIME_START"))
  {
    toRet = wifiConfig.BtLogTime_Start;
  }
  else if (var == F("BTLOGTIME_STOP"))
  {
    toRet = wifiConfig.BtLogTime_Stop;
  }
  else if (var == F("B_CLRSPIFF_ON_RST"))
  {
    toRet = (wifiConfig.clrSpiffOnRst) ? "checked" : "";
  }

  return toRet;
}

void config_HTML(AsyncWebServerRequest *request, bool paramsSaved = false, bool resetRequired = false)
{
  b_paramsSaved = paramsSaved;
  b_resetRequired = resetRequired;

  String tmp = config_html;
#ifdef IFTTT
  tmp.replace(F("%IFTTT%"), IFTTT_html);
#else
  tmp.replace(F("%IFTTT%"), F(""));
#endif

  // server.send(200, "text/html; charset=utf-8", replacer_config(config_html));
  request->send_P(200, "text/html; charset=utf-8", tmp.c_str(), processor_config);

