SmokyBob/Bluetti_ESP32/Bluetti_ESP32/BWifi.cpp
  _rebootDevice = resetRequired;
}

void config_POST(AsyncWebServerRequest *request)
{
  bool resetRequired = false;

  bool isPost = true;

  if (request->methodToString() == "GET")
    isPost = false;

  String tmp = request->getParam("bluetti_device_id", isPost)->value();

  if (tmp.compareTo(wifiConfig.bluetti_device_id) != 0)
  {
    wifiConfig.bluetti_device_id = tmp;
    resetRequired = true;
  }

  if (request->hasParam("APMode", isPost))
  {
    if (wifiConfig.APMode != true)
    {
      resetRequired = true;
    }
    wifiConfig.APMode = true;
  }
  else
  {
    if (wifiConfig.APMode != false)
    {
      resetRequired = true;
    }
    wifiConfig.APMode = false;
  }

  char tmp1[50];
  strcpy(tmp1, request->getParam("ssid", isPost)->value().c_str());
  if (strcmp(tmp1, wifiConfig.ssid.c_str()) != 0)
  {
    wifiConfig.ssid = request->getParam("ssid", isPost)->value();
    resetRequired = true;
  }
  strcpy(tmp1, request->getParam("password", isPost)->value().c_str());
  if (strcmp(tmp1, wifiConfig.password.c_str()) != 0)
  {
    wifiConfig.password = request->getParam("password", isPost)->value();
    resetRequired = true;
  }

#ifdef IFTTT
  // IFTT (no restart required)
  if (request->hasParam("useIFTT", isPost))
  {
    wifiConfig.useIFTT = true;
    wifiConfig.IFTT_Key = request->getParam("IFTT_Key", isPost)->value();
    wifiConfig.IFTT_Event_low = request->getParam("IFTT_Event_low", isPost)->value();
    wifiConfig.IFTT_low_bl = request->getParam("IFTT_low_bl", isPost)->value().toInt();
    wifiConfig.IFTT_Event_high = request->getParam("IFTT_Event_high", isPost)->value();
    wifiConfig.IFTT_high_bl = request->getParam("IFTT_high_bl", isPost)->value().toInt();
  }
  else
  {
    wifiConfig.useIFTT = false;
  }
#endif

  wifiConfig.showDebugInfos = request->hasParam("showDebugInfos", isPost);
  wifiConfig._useBTFilelog = request->hasParam("_useBTFilelog", isPost);
  wifiConfig.useDbgFilelog = request->hasParam("useDbgFilelog", isPost);
  wifiConfig.BtLogTime_Start = request->getParam("BtLogTime_Start", isPost)->value();
  wifiConfig.BtLogTime_Stop = request->getParam("BtLogTime_Stop", isPost)->value();

  if (request->hasParam("clrSpiffOnRst", isPost))
  {
    wifiConfig.clrSpiffOnRst = true;
    resetRequired = true;
  }

  // Save configuration to Preferences
  saveConfig();

  // Config Data Updated, refresh the page
  config_HTML(request, true, resetRequired);
}

void invertBT_HTML(AsyncWebServerRequest *request)
{
  bool restartToReconnect = false;
  if (isBTconnected())
  {
    disconnectBT();
  }
  else
  {
    // IF BLE didn't\ create memory issues
    manualDisconnect = false;
    doScan = true;
    initBluetooth(); // restart the scan task
  }

  request->send(200, "text/html",
                "<html><body onload='location.href=\"./\"';></body></html>");

  if (restartToReconnect)
  {
    ESP.restart();
  }
}

void showDebugLog_HTML(AsyncWebServerRequest *request)
{
  // File Download instead of show
  request->send(SPIFFS, "/debug_log.txt", "text/text", true);
}

void showDataLog_HTML(AsyncWebServerRequest *request)
{
  // File Download instead of show
  request->send(SPIFFS, "/bluetti_data.json", "text/text", true);
}

void onWebSocketEvent(AsyncWebSocket *server, AsyncWebSocketClient *client, AwsEventType type, void *arg, uint8_t *data, size_t len)
{
  switch (type)
  {
  case WS_EVT_CONNECT:
    Serial.printf("WebSocket client #%u connected from %s\n", client->id(), client->remoteIP().toString().c_str());
    update_root(); // update the webpage accordingly
    break;
  case WS_EVT_DISCONNECT:
    Serial.printf("WebSocket client #%u disconnected\n", client->id());
    break;
  case WS_EVT_DATA:
    // TODO: instead of post command
    // AwsFrameInfo *info = (AwsFrameInfo *)arg;
    // if (info->final && info->index == 0 && info->len == len && info->opcode == WS_TEXT)
    // {
    //   data[len] = 0;
    //   message = (char *)data;
    //   steps = message.substring(0, message.indexOf("&"));
    //   direction = message.substring(message.indexOf("&") + 1, message.length());
    //   Serial.print("steps");
    //   Serial.println(steps);
    //   Serial.print("direction");
    //   Serial.println(direction);
    //   notifyClients(direction);
    //   newRequest = true;
    // }
    break;
  case WS_EVT_PONG:
  case WS_EVT_ERROR:
    break;
  }
}

void setWebHandles()
{
  // WebServerConfig
  server.on("/", HTTP_GET, root_HTML);

  server.on("/rebootDevice", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    request->send(200, "text/plain", "reboot in 2sec");
    writeLog("Device Reboot requested!");
    disconnectBT();//Gracefully disconnect from BT
    _rebootDevice = true; });

  server.on("/resetWifiConfig", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    request->send(200, "text/plain", "reset Wifi and reboot in 2sec");
    _resetWifiConfig = true; });

  server.on("/resetConfig", HTTP_GET, [](AsyncWebServerRequest *request)
            {
    request->send(200, "text/plain", "reset FULL CONFIG and reboot in 2sec");
    resetConfig();
    _rebootDevice = true; });

  // Commands come in with a form to the /post endpoint
  server.on("/post", HTTP_POST, command_HTML);
  // ONLY FOR TESTING
  // server.on("/get", HTTP_GET, command_HTML);

  // endpoints to update the config WITHOUT reset
  server.on("/config", HTTP_GET, [](AsyncWebServerRequest *request)
            { config_HTML(request, false); });
  server.on("/config", HTTP_POST, config_POST);

  // BTDisconnect //TODO: post only with JS... when the html code is in a separate file
  server.on("/btConnectionInvert", HTTP_GET, invertBT_HTML);

  server.on("/debugLog", HTTP_GET, showDebugLog_HTML);

  server.on("/clearLog", HTTP_GET, [](AsyncWebServerRequest *request)
            {
              clearLog();
              request->send(200, "text/plain", "Log Cleared"); });

  server.on("/clearBtData", HTTP_GET, [](AsyncWebServerRequest *request)
            {
              clearBtData();
              request->send(200, "text/plain", "BtData Cleared"); });

  server.on("/dataLog", HTTP_GET, showDataLog_HTML);

