SmokyBob/Bluetti_ESP32/Bluetti_ESP32/BWifi.cpp
  server.onNotFound(notFound);

  webSocket.onEvent(onWebSocketEvent); // Register WS event handler
  server.addHandler(&webSocket);

  AsyncElegantOTA.begin(&server); // Start AsyncElegantOTA
  server.begin();
}

#pragma endregion Async Ws handlers

class CaptiveRequestHandler : public AsyncWebHandler
{
public:
  CaptiveRequestHandler()
  {
    setWebHandles(); // Routes that are managed and don't need to be redirected
  }
  virtual ~CaptiveRequestHandler() {}

  bool canHandle(AsyncWebServerRequest *request)
  {
    // request->addInterestingHeader("ANY");
    return true;
  }

  void handleRequest(AsyncWebServerRequest *request)
  {
    Serial.println(F("<- Request redirected to captive portal"));

    AsyncResponseStream *response = request->beginResponseStream("text/plain");
    response->setCode(302);
    response->addHeader(F("Location"), (String)F("http://") + WiFi.softAPIP().toString());
    request->send(response);
  }
};

void wifiConnect(bool resetWifi)
{

  if (resetWifi)
  {
    // Reset AP Mode
    readConfigs();
    wifiConfig.APMode = true;
    wifiConfig.ssid = "";
    wifiConfig.password = "";
    saveConfig();
  }

  if (!wifiConfig.APMode && wifiConfig.ssid.length() > 0)
  {

    WiFi.mode(WIFI_STA);
    WiFi.begin(wifiConfig.ssid.c_str(), wifiConfig.password.c_str());

    unsigned long connectTimeout = millis();
    // Wait for connection
    while (WiFi.status() != WL_CONNECTED)
    {
      delay(500);
      Serial.print(F("."));
      if ((millis() - connectTimeout) > (DEVICE_STATE_UPDATE * 1000))
      {
        Serial.println("Wifi Not connected with ssid: " + wifiConfig.ssid + " ! Reset config");
        writeLog("Wifi Not connected with ssid: " + wifiConfig.ssid + " ! Reset config");
        wifiConfig.APMode = true;
        wifiConfig.ssid = "";
        wifiConfig.password = "";
        saveConfig();
        ESP.restart();
      }
    }
    Serial.println(F(""));
    Serial.println(F("IP address: "));
    Serial.println(WiFi.localIP());

    if (MDNS.begin(DEVICE_NAME))
    {
      Serial.println(F("MDNS responder started"));
    }
  }
  else
  {

    //  Start AP MODE
    WiFi.softAP(DEVICE_NAME);
    Serial.println(F(""));
    Serial.println(F("IP address: "));
    Serial.println(WiFi.softAPIP());

    doCaptivePortal = true;
    /* Setup the DNS server redirecting all the domains to the apIP */
    dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
    dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
    server.addHandler(new CaptiveRequestHandler()).setFilter(ON_AP_FILTER); // only when requested from AP
  }
}

void initBWifi(bool resetWifi)
{

  readConfigs();

  if (wifiConfig.salt != EEPROM_SALT)
  {
    Serial.println(F("Invalid settings in EEPROM, trying with defaults"));
    ESPBluettiSettings defaults;
    wifiConfig = defaults;
  }

  wifiConnect(resetWifi);

  if (!doCaptivePortal)
    setWebHandles();

  Serial.println(F("HTTP server started"));
  writeLog("HTTP server started");
  Serial.print(F("Bluetti Device id to search for: "));
  Serial.println(wifiConfig.bluetti_device_id);
  // Init Array
  copyArray(bluetti_device_state, bluetti_state_data, sizeof(bluetti_device_state) / sizeof(device_field_data_t));
}

unsigned long webSockeUpdate = 0;

void handleWebserver()
{
  if (doCaptivePortal)
  {
    // DNS
    dnsServer.processNextRequest();
  }

  if (!wifiConfig.APMode && wifiConfig.ssid.length() > 0 && runningSince.length() == 0)
  {
    struct tm timeinfo;
    if (!getLocalTime(&timeinfo, DEVICE_STATE_UPDATE * 1000))
    {
      Serial.println(F("Failed to obtain time"));
    }
    else
    {
      // Save start time as string in the preferred format
      // Full param list
      // https://cplusplus.com/reference/ctime/strftime/
      char buffer[80];
      strftime(buffer, 80, "%F %T", &timeinfo); // ISO

      runningSince = String(buffer);
    }
  }

  if ((unsigned long)(millis() - webSockeUpdate) >= DEVICE_STATE_UPDATE * 1000)
  {
    update_root();             // Update the root page with the latest data
    webSockeUpdate = millis(); // Use the snapshot to set track time until next event
  }

  webSocket.cleanupClients();
}

String runningSince;